app/Http/Controllers/IndexController.php

select * from `memo`
---
  public function get(){
    $memos = DB::table('memo')->get();

insert into `memo` (`title`, `memo`, `backgroundColor`) values ('', 'ddd', '#feb365')
select max(`id`) as aggregate from `memo`
select * from `memo` where `id` = 135 limit 1
---
  public function post(Request $request){
    switch($request->mode){
      case 'select':
        $selectAll = DB::table('memo')->where('isArchive',false)->orderBy('id','desc')->get();
        header('content-type: application/json; charset=utf-8');
        echo json_encode($selectAll);
        break;
      case 'create':
        $param = [
          // 'mode' => $request->mode,
          'title' => $request->title,
          'memo' => $request->memo,
          'backgroundColor'=>$request->backgroundColor,
          'label'=>$request->label,
          'isArchive' => false
        ];
        DB::beginTransaction();
        try{
          DB::table('memo')->insert($param);
          $lastInsertId = DB::table('memo')->max('id');
          $lastInsertMemo = DB::table('memo')->where('id',$lastInsertId)->first();

update `memo` set `title` = '', `memo` = 'ddd', `backgroundColor` = '#d0d0d0' where `id` = 135
---
          'isFavorite'=>$request->isFavorite
        ];
        \Debugbar::info($param);
        DB::table('memo')->where('id',$request->id)->update($param);